window.shinkansenData = {
  "北海道新幹線": [
    ["新青森", "しんあおもり"],
    ["奥津軽いまべつ", "おくつがるいまべつ"],
    ["木古内", "きこない"],
    ["新函館北斗", "しんはこだてほくと"]
  ],
  "東北新幹線": [
    ["東京", "とうきょう"], ["上野", "うえの"], ["大宮", "おおみや"],
    ["小山", "おやま"], ["宇都宮", "うつのみや"], ["那須塩原", "なすしおばら"],
    ["新白河", "しんしらかわ"], ["郡山", "こおりやま"], ["福島", "ふくしま"],
    ["白石蔵王", "しらいしざおう"], ["仙台", "せんだい"], ["古川", "ふるかわ"],
    ["くりこま高原", "くりこまこうげん"], ["一ノ関", "いちのせき"],
    ["水沢江刺", "みずさわえさし"], ["北上", "きたかみ"], ["新花巻", "しんはなまき"],
    ["盛岡", "もりおか"], ["いわて沼宮内", "いわてぬまくない"], ["二戸", "にのへ"],
    ["八戸", "はちのへ"], ["七戸十和田", "しちのへとわだ"], ["新青森", "しんあおもり"]
  ],
  "上越新幹線": [
    ["東京", "とうきょう"], ["上野", "うえの"], ["大宮", "おおみや"],
    ["熊谷", "くまがや"], ["本庄早稲田", "ほんじょうわせだ"], ["高崎", "たかさき"],
    ["上毛高原", "じょうもうこうげん"], ["越後湯沢", "えちごゆざわ"],
    ["浦佐", "うらさ"], ["長岡", "ながおか"], ["燕三条", "つばめさんじょう"], ["新潟", "にいがた"]
  ],
  "北陸新幹線": [
    ["東京", "とうきょう"], ["上野", "うえの"], ["大宮", "おおみや"],
    ["熊谷", "くまがや"], ["本庄早稲田", "ほんじょうわせだ"], ["高崎", "たかさき"],
    ["安中榛名", "あんなかはるな"], ["軽井沢", "かるいざわ"], ["佐久平", "さくだいら"],
    ["上田", "うえだ"], ["長野", "ながの"], ["飯山", "いいやま"],
    ["上越妙高", "じょうえつみょうこう"], ["糸魚川", "いといがわ"],
    ["黒部宇奈月温泉", "くろべうなづきおんせん"], ["富山", "とやま"],
    ["新高岡", "しんたかおか"], ["金沢", "かなざわ"], ["小松", "こまつ"],
    ["加賀温泉", "かがおんせん"], ["芦原温泉", "あわらおんせん"], ["福井", "ふくい"],
    ["越前たけふ", "えちぜんたけふ"], ["敦賀", "つるが"]
  ],
  "東海道新幹線": [
    ["東京", "とうきょう"], ["品川", "しながわ"], ["新横浜", "しんよこはま"],
    ["小田原", "おだわら"], ["熱海", "あたみ"], ["三島", "みしま"],
    ["新富士", "しんふじ"], ["静岡", "しずおか"], ["掛川", "かけがわ"],
    ["浜松", "はままつ"], ["豊橋", "とよはし"], ["三河安城", "みかわあんじょう"],
    ["名古屋", "なごや"], ["岐阜羽島", "ぎふはしま"], ["米原", "まいばら"],
    ["京都", "きょうと"], ["新大阪", "しんおおさか"]
  ],
  "山陽新幹線": [
    ["新大阪", "しんおおさか"], ["新神戸", "しんこうべ"], ["西明石", "にしあかし"],
    ["姫路", "ひめじ"], ["相生", "あいおい"], ["岡山", "おかやま"],
    ["新倉敷", "しんくらしき"], ["福山", "ふくやま"], ["新尾道", "しんおのみち"],
    ["三原", "みはら"], ["東広島", "ひがしひろしま"], ["広島", "ひろしま"],
    ["新岩国", "しんいわくに"], ["徳山", "とくやま"], ["新山口", "しんやまぐち"],
    ["厚狭", "あさ"], ["新下関", "しんしものせき"], ["小倉", "こくら"], ["博多", "はかた"]
  ],
  "九州新幹線": [
    ["博多", "はかた"], ["新鳥栖", "しんとす"], ["久留米", "くるめ"],
    ["筑後船小屋", "ちくごふなごや"], ["新大牟田", "しんおおむた"], ["新玉名", "しんたまな"],
    ["熊本", "くまもと"], ["新八代", "しんやつしろ"], ["新水俣", "しんみなまた"],
    ["出水", "いずみ"], ["川内", "せんだい"], ["鹿児島中央", "かごしまちゅうおう"]
  ],
  "西九州新幹線": [
    ["武雄温泉", "たけおおんせん"], ["嬉野温泉", "うれしのおんせん"],
    ["新大村", "しんおおむら"], ["諫早", "いさはや"], ["長崎", "ながさき"]
  ]
};
